import { notification } from 'antd';

const errorMapping = {
  '10008': '服务器忙，请稍后重试',
  '10016': '处理数据[长度|时长]受限。(ASR时为时长，其他能力为长度)',
  '10018': '处理数据[长度|时长]受限。(ASR时为时长，其他能力为长度)',
  '10031': '音频格式不支持',
  '10032': '采样格式不支持',
  '12014': '采样格式不支持',
  '12015': '采样格式不支持',
  '15001': '服务器忙，请稍后重试',
  '15002': '服务器忙，请稍后重试',
  '15003': '服务器忙，请稍后重试',
  '15004': '服务器忙，请稍后重试',
  '15005': '服务器忙，请稍后重试',
  '15006': '服务器忙，请稍后重试',
  '19001': '服务器忙，请稍后重试',
  '19002': '服务器忙，请稍后重试',
  '19003': '服务器忙，请稍后重试',
  '19004': '服务器忙，请稍后重试',
  '19005': '服务器忙，请稍后重试',
  '20001': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20002': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20003': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20004': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20005': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20006': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20007': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20008': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20009': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20010': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20011': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20012': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20013': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20014': '音频解码失败，请确认选择的音频文件格式是否正确',
  '20015': '音频解码失败，请确认选择的音频文件格式是否正确',
  '50002': '服务器忙，请稍后重试',
  '51018': '服务器忙，请稍后重试',
  '51019': '服务器忙，请稍后重试',
  '51020': '服务器忙，请稍后重试',
  '51021': '服务器忙，请稍后重试',
  '51022': '服务器忙，请稍后重试',
  '51023': '服务器忙，请稍后重试',
  '51024': '服务器忙，请稍后重试',
  '51025': '服务器忙，请稍后重试',
  '51026': '服务器忙，请稍后重试',
  '51037': '服务器忙，请稍后重试',
  '51038': '服务器忙，请稍后重试',
  '51039': '服务器忙，请稍后重试',
  '51040': '服务器忙，请稍后重试',
  '51057': '服务器忙，请稍后重试',
  '51058': '服务器忙，请稍后重试',
  '51065': '服务器忙，请稍后重试',
};

type Data = {
  data?: {
    code?: number;
    message?: string;
  };
};

export const errorTip = (data: Data): any => {
  const code = data?.data?.code;
  const message = data?.data?.message;

  if (code && code !== 0) {
    notification.error({
      message: errorMapping[code!] || code,
      description: message,
    });
  }

  return data;
};
